Repository: d79/wp-show-site-by-ip
Catalog: languages/wp-show-site-by-ip-*.po
Languages: it_it

source: Activate or deactivate the IP filter: when enabled everyone but who gained access to the whitelist of IP addresses will see the temporary page.
it_it: Attivare o disattivare il filtro IP: se abilitato, chi non ha inserito l'IP della propria connessione nella whitelist vedrà la pagina temporanea.

# admin toolbar link
source: Filter by IP disabled
it_it: Filtro per IP disabilitato

# admin toolbar link
source: Filter by IP enabled
it_it: Filtro per IP abilitato

source: After installed this plugin, you'll find the submenu <b>Show Site by IP</b> on your website Dashboard, under the <b>Tools</b> menu.
it_it: Dopo aver installato il plugin, si può trovare la voce <b>Mostra sito per IP</b> nella Bacheca del sito, nel menù <b>Strumenti</b>.

source: Are you sure? The code will be definitely deleted
it_it: Sei sicuro? Il codice verrà eliminato definitivamente

source: Authorized IPs
it_it: IP autorizzati

source: Body content
it_it: Contenuto body

source: Choose the Hypertext Transfer Protocol (HTTP) response status code for the temporary page. This is useful mainly for communicating the temporary status of the website to the search engines.
it_it: Scegliere il codice di stato della risposta Hypertext Transfer Protocol (HTTP) per la pagina temporanea. Ciò è utile principalmente per comunicare lo stato provvisorio del sito web ai motori di ricerca.

source: Choose the %sHTTP Status code%s for the temporary page
it_it: Scegli il %sCodice di stato HTTP%s per la pagina temporanea

source: Don't worry, your IP will be automatically added to the whitelist
it_it: Non preoccuparti, il tuo IP verrà aggiunto automaticamente alla whitelist

source: Enable filter
it_it: Abilita filtro

source: Enable or disable the IP filter
it_it: Abilita o disabilita il filtro IP

source: Even better you don't have to find out your IP and then save it on some sort of whitelist, you can simply add the string <code>wpok</code> to you url to automatically obtain the permission to see your website, without even knowing your IP!!!
it_it: Ancora meglio non c'è bisogno di sapere il proprio indirizzo IP e poi salvarlo su una qualche whitelist, si può semplicemente aggiungere una stringa personalizzabile all'URL per ottenere automaticamente il permesso di vedere il proprio sito web!

source: Forget old code
it_it: Dimentica vecchio codice

source: General settings
it_it: Impostazioni generali

source: Got any questions?
it_it: Qualche domanda?

source: Guide
it_it: Guida

source: Here you can manually edit the list of authorized IPs
it_it: Qui puoi modificare manualmente la lista di IP autorizzati

source: Hide the website to unknown IPs and show a temporary and fully customizable page instead.
it_it: Nascondi il sito a IP sconosciuti e mostra invece una pagina temporanea e completamente personalizzata.

source: Hide your Wordpress website to unknown IPs and replace it with a HTML page. Useful for developers to work online in private (e.g. maintenance).
it_it: Nascondi il tuo sito Wordpress ad IP sconosciuti e sostituiscilo con una pagina HTML. Utile per sviluppatori che necessitano di lavorare online in privato (es. manutenzione).

source: How it works
it_it: Come funziona

source: HTML body content of the temporary page
it_it: Contenuto HTML della pagina temporanea

source: HTTP Status
it_it: Stato HTTP

# HTTP status
source: Default is 503: &quot;The server is currently unavailable (because it is overloaded or down for maintenance)&quot;.
it_it: Predefinito è 503: &quot;Il server non è attualmente disponibile (perché sovraccaricato o in manutenzione)&quot;.

source: If this plugin helped, please consider %s rewarding it with 5 stars %s thank you!
it_it: Se il plugin è stato d'aiuto, fallo sapere %s ricompensandolo con 5 stelle %s grazie!

source: If you want to better understand how this plugin works, please take advantage of the help inline to find the answers you need.
it_it: Se vuoi capire meglio il funzionamento del plugin, approfitta della guida online per trovare le risposte che cerchi.

source: Insert one IP address for line
it_it: Inserisci un indirizzo IP per linea

source: IPs list
it_it: Lista IP

source: It's the content of the title tag of the temporary page.
it_it: E' il contenuto del tag title (cioè il titolo) della pagina temporanea

source: It's the HTML content of the body tag of the temporary page.
it_it: E' il contenuto HTML del tag body della pagina temporanea

source: It's the list of authorized IPs and can be manually edited.
it_it: È la lista di IP autorizzati e può essere modificata manualmente.

source: It's the string this plugin will look for in the URL to deny access to the website: if found, the IP from which the user is connecting will be removed from the whitelist, and then the temporary page will be shown.
it_it: E' la stringa che il plugin cercherà nell'URL per negare l'accesso al sito web: se trovata, l'IP da cui l'utente si connette verrà rimosso dalla whitelist, e perciò verrà visualizzata la pagina temporanea.

source: It's the string this plugin will look for in the URL to grant access to the website: if found, the IP from which the user is connecting will be added to the whitelist, allowing him to see the website.
it_it: E' la stringa che il plugin cercherà nell'URL per concedere l'accesso al sito web: se trovata, l'IP da cui l'utente si connette verrà aggiunto alla whitelist, e avrà il permesso di vedere il sito.

# menu title
source: Show Site by IP
it_it: Mostra sito per IP

source: Need support?
it_it: Bisogno di aiuto?

source: Page title
it_it: Titolo pagina

# page title
source: Show Site by IP
it_it: Mostra sito per IP

source: Plugin guide
it_it: Guida del plugin

source: Plugin Support Forum
it_it: Forum di supporto del plugin

source: Rate this plugin
it_it: Vota questo plugin

source: Report a bug
it_it: Segnala un bug

source: Settings
it_it: Impostazioni

source: Show Site by IP
it_it: Mostra Sito per IP

source: Sometimes you need to work directly on your online Wordpress installation, like when you are developing or refining a theme for your site, and you don't want others to see your work in progress, but at the same time you need to be able to see it from whatever place you find yourself!!!
it_it: A volte è necessario lavorare direttamente sul proprio sito Wordpress online, come quando si sta sviluppando o perfezionando un tema, e non si vuole far vedere ad altri il lavoro in corso, ma allo stesso tempo è necessario poterlo vedere da qualunque posto ci si trovi.

source: String KO
it_it: Stringa KO

source: String OK
it_it: Stringa OK

source: String to append to the URL to see the temporary page
it_it: Stringa da aggiungere all'URL per vedere la pagina temporanea

source: String to append to the URL to see the website
it_it: Stringa da aggiungere all'URL per vedere il sito

source: Styles & scripts
it_it: Stili e script

source: Styles and scripts for the temporary page
it_it: Stili e script per la pagina temporanea

source: Suggestions
it_it: Suggerimenti

source: Support forum
it_it: Forum di supporto

source: Temporary page
it_it: Pagina temporanea

# Temporary page settings
source: Page title
it_it: Titolo pagina

source: That link open the plugin configuration page, where you can insert the full HTML of your temporary page and, when you are good to go, enable the IP filter.
it_it: Il collegamento apre la pagina di configurazione del plugin, in cui è possibile inserire il codice HTML completo della pagina temporanea e, al momento utile, attivare il filtro IP.

source: That makes it easier to work on your website from many different places (e.g. if you work on it with other people from different locations) or if you have an internet connection with dynamic IP (everytime it changes you can easily add the new one).
it_it: Questo rende più facile lavorare al proprio sito web da luoghi diversi (ad esempio, se si lavora con altre persone da postazioni diverse), o se si dispone di una connessione ad internet con IP dinamico (ogni volta che cambia è possibile aggiungere facilmente quello nuovo).

source: That's it. 🙂
it_it: E questo è tutto. 🙂

source: The changes you made will be lost if you navigate away from this page.
it_it: Le modifiche apportate verranno perse se lasci questa pagina.

source: The temporary page editor has changed.
it_it: L'editor della pagina temporanea è cambiato.

source: This code will be loaded inside the head tag of the temporary page, and it allows to add some styles (CSS) and scripts (Javascript) to the page, even from external resources.
it_it: Questo codice verrà caricato all'interno del tag head della pagina temporanea, e permette di aggiungere alcuni stili (CSS) e script (JavaScript) alla pagina, anche da risorse esterne.

source: This plugin allows you very easily to load a temporary HTML page for your website visitors, but it filters the IP of your connection and let you see your website and work on it.
it_it: Questo plugin permette facilmente di caricare una pagina HTML temporanea per i visitatori, ma filtra l'IP della propria connessione, consentendo così di lavorare direttamente sul sito.

source: Title tag of the temporary page
it_it: Tag title della pagina temporanea

source: To allow access to your website from an internet connection add the string <code>?wpok</code> to the website URL, like this:
it_it: Per consentire l'accesso al tuo sito web da una connessione internet aggiungere la stringa <code>?wpok</code> in coda all'URL del sito web, in questo modo:

source: To remove your IP from the whitelist afterwards (and then go back to see the temporary page instead of your website) add the string <code>?wpko</code> to the website URL, like this:
it_it: Per rimuovere il tuo IP dalla whitelist (e quindi vedere la pagina temporanea invece del sito) aggiungere la stringa <code>?wpko</code> in coda all'URL, in questo modo:

# URL example for string ko
source: (e.g. %s)
it_it: (es. %s)

# URL example for string ok
source: (e.g. %s)
it_it: (es. %s)

source: View old code
it_it: Vedi vecchio codice

source: Warning: the filter by IP is enabled. Your users are seeing the temporary page instead of your website.
it_it: Attenzione: il filtro per IP è attivo. I visitatori stanno vedendo la pagina temporanea invece del sito.

source: What it does
it_it: Cosa fa

source: Why it's useful
it_it: Perché è utile

source: WP Show Site by IP
it_it: WP Mostra Sito per IP

source: Your curent IP will not be removed
it_it: Il tuo IP attuale non verrà rimosso

source: Your IP will be automatically added to the whitelist in order for you to continue to use your website.
it_it: Il tuo IP verrà aggiunto automaticamente alla whitelist, in modo da permetterti di continuare ad utilizzare il sito web.
